
#  Задача 2
#  Создайте список "города " с именами любых городов
#  Количество элементов в списке "города" не меньше 3!

#  Создайте список списков населения перечисленных городов

#  Выведите на консоль население второго города в списке формата
#  Население Москвы - XX человек

#  Выведите на консоль общий размер населения перечисленных городов как сумму
#  Итого размер населения - XX человек. 

list_town = 'Москва', 'Рим', 'Париж'
list_population = 12632409, 2870493, 2206488

x = list_town
y = list_population

print ('Население', x[1],'-', y[1], 'человек')

print ('Итого размер населения -',sum(y),'человек')





















